# require ../section

class App.Views.IncomePensionSection extends App.Views.Section

  id: 'income-pension-section'
  templateName: 'income_pension'

  events:
    'change [name=pns-options]' : 'onOptionChange'

  isEnabled: ->
    @model.get 'pension'

  onOptionChange: (e) ->
    console.log 'change'

  render: ->
    super
    ac = ->
      $('#pns-search-box').autocomplete
        position:
          my: "right top"
          at: "right bottom"

        source: [
          "אחר"

          "אי.בי.אי בית השקעות"

          "אי.בי.אי גמל"

          "איילון חברה לביטוח"

          "איילון פנסיה"

          "איילון פנסיה וגמל"

          "אינפיניטי ניהול השתלמות וגמל"

          "אינפיניטי ניהול תיקי השקעות (בישראל ובעולם)"

          "אלטשולר שחם"

          "אלטשולר שחם גמל ופנסיה"

          "אנליסט קופות גמל"

          "אנליסט שירותי ניהול השקעות"

          "אפסילון בית השקעות"

          "אפסילון ניהול קופות גמל"

          "אקסלנס השקעות"

          "אקסלנס נשואה גמל ופנסיה"

          "ארגון המורים העל יסודיים"

          "ארם גמולים \- חברה לניהול קופות גמל"

          "גילעד גימלאות לעובדים דתיים"

          "גילעד קרן פנסיה מקיפה"

          "גל גמל למורים \- חברה לניהול קופות גמל למורים"

          "דש איפקס הולדינגס"

          "הגומל חברה לניהול קופות גמל"

          "הדס ארזים"

          "הדס ארזים קופות גמל"

          "החברה המנהלת של מינהל קרן ההשתלמות לפקידים עובדי המנהל והשירותים"

          "החברה המנהלת של קרן השתלמות של עובדי חברת החשמל לישראל"

          "החברה המנהלת של רום קרן ההשתלמות לעובדי הרשויות המקומיות"

          "החברה לניהול קופות גמל של עובדי בנק דיסקונט"

          "החברה לניהול קופות התגמולים של עובדי בנק לאומי ושל עובדי בנק לאומי למשכנתאות"

          "החברה לניהול קרן ההשתלמות להנדסאים וטכנאים"

          "החברה לניהול קרן השתלמות לאקדמאים במדעי החברה והרוח"

          "החברה לניהול קרן השתלמות לביוכימאים  ומקרוביולוגים"

          "החברה לניהול קרן השתלמות למשפטנים"

          "החברה לניהול קרן השתלמות לעובדי המדינה"

          "החברה לניהול קרן השתלמות לשופטים"

          "הכשרה חברה לביטוח"

          "הכשרה פנסיה וגמל"

          "הלמן \- אלדובי קופות גמל ופנסיה"

          "הלמן אלדובי פיננסים"

          "הנדסאים וטכנאים \- חברה לניהול קופות גמל"

          "הסת\x27 האקדמאים במח\x22ר, ניהול קופו\x22ג"

          "הסתדרות המורים בישראל"

          "הפניקס הישראלי חברה לביטוח"

          "הפניקס חברה לביטוח"

          "הפניקס פנסיה וגמל"

          "הראל גמל והשתלמות"

          "הראל השקעות בביטוח ושירותים פיננסיים"

          "הראל ניהול קרנות פנסיה"

          "חבר משרתי הקבע"

          "חברה לניהול קופות גמל של העובדים באוניברסיטה העברית בירושלים"

          "חברה לניהול קופות גמל של העובדים בעיריית תל \- אביב יפו"

          "חברה לניהול קופת גמל מפעלית ליד קופת התגמולים לעובדים אקדמאיים של אוניברסיטת תל אביב (1965)"

          "ידידים הולדינג וניהול (1984)"

          "ידידים סוכנויות לביטוח (1987)"

          "יהב \- פ.ר.ח. \- חברה לניהול קופות גמל"

          "יהב אחים ואחיות \- חברה לניהול קופות גמל"

          "יהב רופאים \- חברה לניהול קופות גמל"

          "יונט ניהול קופות גמל"

          "ילין לפידות החזקות"

          "ילין לפידות ניהול קופות גמל"

          "כור\-תדיראן גמל"

          "כלל חברה לביטוח"

          "כלל פנסיה וגמל"

          "ללא"

          "מבטחים מוסד לביטוח סוציאלי של העובדים"

          "מגדל אחזקות ביטוח ופיננסים"

          "מגדל חברה לביטוח"

          "מגדל מקפת קרנות פנסיה וקופות גמל"

          "מחוג \- מינהל גמל לעובדי חברת חשמל לישראל"

          "מיטב בית השקעות"

          "מיטב דש גמל ופנסיה"

          "מנורה מבטחים ביטוח"

          "מנורה מבטחים גמל"

          "מנורה מבטחים החזקות"

          "מנורה מבטחים פנסיה"

          "עגור חברה לניהול קופות גמל וקרנות השתלמות"

          "עו\x22ס \- חברה לניהול קופות גמל"

          "עוצ\x22מ חברה לניהול קופות גמל והשתלמות"

          "עוצ\x22מ קופ\x22ג של עובדי ציבור במושבים"

          "עמ\x22י \- חברה לניהול קופות גמל ענפיות"

          "עמיתים"

          "פסגות בית השקעות"

          "פסגות קופות גמל ופנסיה"

          "ק.ל.ע. \- חברה לניהול קרן השתלמות לעובדים סוציאליים"

          "קו הבריאות חברה לניהול קופות גמל"

          "קרן ביטוח ופנסיה לפועלים חקלאים ובלתי מקצועיים בישראל אגודה שיתופית"

          "קרן הביטוח והפנסיה של פועלי בנין ועבודות ציבוריות אגודה שיתופית"

          "קרן החסכון לצבא הקבע \- חברה לניהול קופות גמל"

          "קרן השתלמות של עובדי המוסדות הלאומיים"

          "קרן מקפת מרכז לפנסיה ותגמולים אגודה שיתופית"

          "קרנות השתלמות למורים ולגננות \- חברה מנהלת"

          "קרנות השתלמות למורים תיכוניים, מורי סמינרים ומפקחים \- חברה מנהלת"

          "רעות חברה לניהול קופות גמל"

          "רשף חברה לניהול קופות גמל למורים על יסודיים"

          "שדות \- חברה לניהול קופות גמל"

          "שובל \- חברה לניהול קופת גמל מפעלית"

          "שי פנסו אחזקות"

          "שיבולת \- חברה לניהול קופות גמל"

          "תדיראן"

          "תמיר פישמן גמל והשתלמות"

          "תמיר פישמן ניהול השקעות"
        ]
    _.delay ac, 200
    this

